Script started on Thu 13 Nov 2014 10:52:24 AM CST
]0;srj0101@cse04: ~/lab/lab12srj0101@cse04:~/lab/lab12$ gcc -g -Wall example2.c
example2.c: In function â€˜mainâ€™:
example2.c:11:11: warning: â€˜bâ€™ is used uninitialized in this function [-Wuninitialized]
]0;srj0101@cse04: ~/lab/lab12srj0101@cse04:~/lab/lab12$ gdb a.out
GNU gdb (Ubuntu/Linaro 7.4-2012.04-0ubuntu2.1) 7.4-2012.04
Copyright (C) 2012 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "i686-linux-gnu".
For bug reporting instructions, please see:
<http://bugs.launchpad.net/gdb-linaro/>...
Reading symbols from /home/srj0101/lab/lab12/a.out...done.
(gdb) b main
Breakpoint 1 at 0x80483ed: file example2.c, line 8.
(gdb) b setint
Breakpoint 2 at 0x804844b: file example2.c, line 18.
(gdb) r
Starting program: /home/srj0101/lab/lab12/a.out 

Breakpoint 1, main () at example2.c:8
8	    setint(&a, 10);
(gdb) print a
$1 = 134513769
(gdb) print b
$2 = (int *) 0x2d8ff4
(gdb) print &a
$3 = (int *) 0xbffff6b8
(gdb) print b
$4 = (int *) 0x2d8ff4
(gdb) print &b
$5 = (int **) 0xbffff6bc
(gdb) print *b
$6 = 1727868
(gdb) print a[K*a
$7 = 462144385
(gdb) n

Breakpoint 2, setint (ip=0xbffff6b8, i=10) at example2.c:18
18	    *ip = i;
(gdb) print i
$8 = 10
(gdb) print &i
$9 = (int *) 0xbffff6a4
(gdb) print ip
$10 = (int *) 0xbffff6b8
(gdb) print &ip
$11 = (int **) 0xbffff6a0
(gdb) print *ip
$12 = 134513769
(gdb) n
19	} 
(gdb) print i[Ka
No symbol "a" in current context.
(gdb) print i
$13 = 10
(gdb) print &i
$14 = (int *) 0xbffff6a4
(gdb) print ip
$15 = (int *) 0xbffff6b8
(gdb) print *ip
$16 = 10
(gdb) print &ip
$17 = (int **) 0xbffff6a0
(gdb) n
main () at example2.c:9
9	    printf("a= %d\n",a);
(gdb) print a
$18 = 10
(gdb) print &a
$19 = (int *) 0xbffff6b8
(gdb) print b
$20 = (int *) 0x2d8ff4
(gdb) print &b
$21 = (int **) 0xbffff6bc
(gdb) print *b
$22 = 1727868
(gdb) n
a= 10
11	    setint(b, 10);
(gdb) print b
$23 = (int *) 0x2d8ff4
(gdb) prit[Knt *b
$24 = 1727868
(gdb) print 7b[K[K&b
$25 = (int **) 0xbffff6bc
(gdb) n

Breakpoint 2, setint (ip=0x2d8ff4, i=10) at example2.c:18
18	    *ip = i;
(gdb) print i
$26 = 10
(gdb) print ip
$27 = (int *) 0x2d8ff4
(gdb) print *ip
$28 = 1727868
(gdb) n

Program received signal SIGSEGV, Segmentation fault.
0x08048451 in setint (ip=0x2d8ff4, i=10) at example2.c:18
18	    *ip = i;
(gdb) n

Program terminated with signal SIGSEGV, Segmentation fault.
The program no longer exists.
(gdb) n
The program is not being run.
(gdb) list
13	    return 0;
14	}
15	
16	void setint(int *ip, int i) 
17	{
18	    *ip = i;
19	} 
(gdb) q
]0;srj0101@cse04: ~/lab/lab12srj0101@cse04:~/lab/lab12$ exit

Script done on Thu 13 Nov 2014 11:02:58 AM CST
